/**
 * 1. 函数剩余的部分 
 *     匿名函数，就是没有名字的函数
 *     自调用函数，自执行函数
 * 
 * 2. arguments  js中的函数内部所特有的一个对象 相当于是实参的一个备份
 *    js是没有重载的，但是可以模拟重载
 *    函数的重载就是，函数名称相同，但是函数的参数个数或是参数类型不同，这就构成了重载，指的是后台语言而言
 *    js中的函数名称不可以重复，如果重复了，后面的会覆盖前面的
 * 
 * 3. 回调函数  就是将函数当做参数进行传递，这样的函数叫做回调函数  
 * 
 * 4. 函数也是一种数据类型
 *      string  number  null undefined boolean 
 *      Object   function
 * 
 * 5. 内置对象
 *      Math  Date  Array   String
 *      主要是学习内置 对象中的那些属性或是方法
 * 
 * 6. 自定义对象
 *      对象字面量 {}   
 *      var zs = {
 *        name:"张三",
 *        age:20,
 *        sex:"男",
 *        score:20
 *       } 
 *      zs.age   zs.score
 *      ["张三",20,"男",20]   
 */